Revit 2027 API
BuiltInFailures.SketchFailures.CircleMultiPlanarShapeInSketch Property
 A circle can't be converted to multiplanar shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircleMultiPlanarShapeInSketch { get; }
Public Shared ReadOnly Property CircleMultiPlanarShapeInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircleMultiPlanarShapeInSketch {
	FailureDefinitionId^ get ();
}
static member CircleMultiPlanarShapeInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace